Autodesk.Revit.DB.ColorOptions.GetColorOptions
Returns the current Revit instance's ColorOptions.
Returns:
The ColorOptions for the current Revit instance.
Since:
2020.1

Autodesk.Revit.DB.ColorOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ColorOptions.EditingColor
The color of the current canvas theme used to render elements when editing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2020.1

Autodesk.Revit.DB.ColorOptions.CalculatingColor
The color of the current canvas theme used to render elements when some aspect of their properties is currently being recalculated.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2020.1

Autodesk.Revit.DB.ColorOptions.AlertColor
The color of the current canvas theme used to highlight elements when a special alert is required.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2020.1

Autodesk.Revit.DB.ColorOptions.PreselectionColor
The color of the current canvas theme used to highlight candidates for selection before they are selected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2020.1

Autodesk.Revit.DB.ColorOptions.SelectionSemitransparent
Indicates whether or not selections will be shown in a semi-transparent manner in current canvas theme.
Since:
2020.1

Autodesk.Revit.DB.ColorOptions.SelectionColor
The color of the current canvas theme used to highlight selected elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2020.1

Autodesk.Revit.DB.ColorOptions.BackgroundColor
The background color of the current canvas theme applied to views.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2020.1

Autodesk.Revit.DB.ColorOptions
A class providing access to color settings which affect the colors applied to specific views.
Remarks:
ColorOptions are managed and stored along with other global application options and thus impact the application as a whole.
Since:
2020.1